nmaciol/ESP32-Audio-Message-Player-main/src/main.cpp
/*  *
 * The MP3 player is based on the following examples:
 * https://github.com/pschatzmann/arduino-audio-tools/blob/main/examples/examples-audiokit/streams-sd_mp3-audiokit/streams-sd_mp3-audiokit.ino
 *              and
 * https://github.com/pschatzmann/arduino-audio-tools/blob/main/examples/examples-tts/streams-google-audiokit/streams-google-audiokit.ino
 *
 */
#include <Arduino.h>
#include <ArduinoJson.h>
#include <WiFi.h>
#include <FS.h>
#include <SD_MMC.h>
#include <AudioTools.h>
#include <AudioTools/Disk/AudioSourceSDMMC.h>
#include <AudioTools/AudioLibs/AudioBoardStream.h>
#include <AudioTools/AudioCodecs/CodecMP3Helix.h>
#include <AudioTools/Communication/AudioHttp.h>
#include <SimpleFTPServer.h>
#include <esp_sleep.h>
#include <ESPmDNS.h>
#include <ESP32Time.h>
#include "sam_arduino.h"
#include <ESP32Ping.h>
#include <RandomUtils.h>

//  Fix SD card access issue in FTP server
//  ----------------------------------------
// !!!!! Overwrite value in  .pio\libdeps\esp32dev\SimpleFTPServer\FtpServerKey.h
/// Line 63 #define DEFAULT_STORAGE_TYPE_ESP32 					STORAGE_SD_MMC

#undef DEFAULT_STORAGE_TYPE_ESP32
#define DEFAULT_STORAGE_TYPE_ESP32 STORAGE_SD_MMC
#include <PubSubClient.h>
#include <QueueList.h>
#include <Regexp.h>


/*
  0.2.0 Add Live Stream  code optimization
  0.2.3 Add  MQTT command to set sleep mode and deep sleep time, and publish sleep mode and WiFi RSSI in ping response
  0.2.4 Add RTC time to ping response and mDNS
  0.2.5 Add MQTT command to get last action 
  0.2.6 Add MQTT connect watchdog and reboot after 20 MQTT connection failures
  0.3.0 Replace SD Lib with SD_MMC, IniFile Lib with ArduinoJson, code optimization, bug fixes, and more MQTT commands
  0.3.1 Remove credentials.h and add error handling for missing or wrong entries in app.json
  0.3.2 Add Audio error mesages via TTS Comodore C64 voice for Config file not exist, json error, network connection error
  0.4.0 Add Simple Web Server functionality
  0.4.1 Add Web UI for Action Key 4 with selectable Sound/Audio Pools, and more MQTT commands to trigger Action Keys and select Sound/Audio Pools
*/

#define FIRMWARE_VERSION "0.4.1"

const char* ntpServer = "pool.ntp.org";
const long  gmtOffset_sec = 3600;        // GMT offset in seconds / Europe/Berlin / CET (Europe)
const int   daylightOffset_sec = 3600; // DST offset in seconds  / Europe/Berlin / CET (Europe)

ESP32Time rtc;
//ESP32Time rtc(3600);  // offset in seconds GMT+1
int chipSelect = PIN_AUDIO_KIT_SD_CARD_CS;
int MqttConnectErrorCounter = 0;
const int errorLED = 22;

// helper.h
void getTtmFileName(String text, char *buf);
bool setGlobalVar();
  

// Declare variables for setting up WLAN, FTP, MQQTT, TTS, etc.
String S_HOST_NAME;
String S_AUDIO_VOLUME;
String S_START_SOUND;

String S_WIFI_SSID;
String S_WIFI_PASSWORD;

String S_FTP_SVR_USER;
String S_FTP_SVR_PASSWORD;

String S_MQTT_SERVER;
String S_MQTT_PORT;
String S_MQTT_USER;
String S_MQTT_PASSWORD;
String S_MQTT_HOUSE;

String S_TTS_QRY_GOOGLE;
String S_TTS_LANG;
String S_TTS_SPEED;
String S_TTS_MAX_LEN_TTM;
boolean B_WEBUI_ENABLE = true;;
boolean B_ACTION_KEYS_ENABLE = true;
boolean B_FTP_SERVER_ENABLE = true;
boolean B_LOW_POWER_MODE_ENABLE = false;
boolean B_MQTT_CLIENT_ENABLE = true;
boolean B_STOP2PRESS_ENABLE = false;

// create a queue of strings messages.
QueueList<String> queueOrder;

// WiFi + MQTT + FTP
WiFiClient wifiClientMqtt;

WiFiClient wifiClient;
WiFiServer  server(80);

URLStream url;
PubSubClient mqttClient(wifiClientMqtt);
FtpServer ftpServer;
File file; // final output stream

AudioBoardStream i2s(AudioKitEs8388V1);
EncodedAudioStream decoder(&i2s, new MP3DecoderHelix()); // Decoding stream

AudioActions action;

// Text-To-Phoneme converter
SAM sam(i2s);
StreamCopy copier; //  Audio Stream Input
File audioFile;
bool bStartup = false;
bool bLiveStreamPause = false;
String acceptMime = "audio/mp3";
String order;
Str query;
String currentLiveStream;
float PreviousVolume = 0;
String PreviousLang = S_TTS_LANG;
String TempVolume = "";
String LastAction = "";

// Variable to store the start time of Action Key 4 for cooldown management
time_t startActionKey4Time;

// JSON document for app.ini file
JsonDocument docIniFile;

// Variable to store the HTTP request
String header;

// Define timeout time in milliseconds (example: 2000ms = 2s)
// This can be used to prevent the server from hanging while waiting for a client request
const long timeoutTime = 2000;

void handleWebUI () {
    Serial.println("New Client.");                  // print a message out in the serial port
    String currentLine = "";     
    int timerCounter = 0;                           // make a String to hold incoming data from the client
    while (wifiClient.connected() &&  timerCounter  < timeoutTime ) {  // loop while the client's connected
      timerCounter++;
      delay(1);
      if (wifiClient.available()) {                   // if there's bytes to read from the client,
        char c = wifiClient.read();                   // read a byte, then
        //Serial.write(c);                            // print it out the serial monitor
        header += c;
        if (c == '\n') {                              // if the byte is a newline character
          // if the current line is blank, you got two newline characters in a row.
          // that's the end of the client HTTP request, so send a response:
          if (currentLine.length() == 0) {
            String index = "";
            wifiClient.println("HTTP/1.1 200 OK");
            wifiClient.println("Content-type:text/html");
            wifiClient.println("Connection: close");
            wifiClient.println();
            // HTTP headers always start with a response code (e.g. HTTP/1.1 200 OK)
            // and a content-type so the client knows what's coming, then a blank line:
            // Display the HTML web page  i2s.incrementVolume(-0.05);
            if (header.indexOf("GET /test") >= 0 || header.indexOf("GET /vol") >= 0  || header.indexOf("GET /sound") >= 0 ){
                index += "OK";
                //Serial.println("Start Test-Sound.");
                // Serial.println("Sound started--Key");
                if (header.indexOf("GET /test1") >= 0) {        // Test Sounds
                  queueOrder.push("mp3" + docIniFile["WebUI"]["test"]["mp3a"].as<String>()); 
                } else if (header.indexOf("GET /test2") >= 0) {
                  queueOrder.push("mp3" +  docIniFile["WebUI"]["test"]["mp3b"].as<String>());
                } else if (header.indexOf("GET /test3") >= 0) {
                  queueOrder.push("tts" +  docIniFile["WebUI"]["test"]["tts"].as<String>());
                }else if (header.indexOf("GET /test4") >= 0) {
                  if (currentLiveStream.length() == 0) {
                    currentLiveStream = docIniFile["WebUI"]["test"]["radio"].as<String>();
                    acceptMime = "audio/mp3";
                    //Serial.println("Start Radio Stream: " + currentLiveStream);
                  } else {
                    //Serial.println("Stop Radio Stream: ");
                    currentLiveStream = "";
                    decoder.end();
                    delay(100);
                    url.flush();
                    url.end();
                    url.clear();
                    copier.end();
                    bLiveStreamPause = true;
                  }
                } else if (header.indexOf("GET /volUp") >= 0) {     // Volume
                  i2s.incrementVolume(0.05);
                } else if (header.indexOf("GET /volDown") >= 0) {
                  i2s.incrementVolume(-0.05);
                } else if (header.indexOf("GET /volRestore") >= 0) {
                  i2s.setVolume((float)S_AUDIO_VOLUME.toFloat());
                }else if (header.indexOf("GET /volSave") >= 0) {                  
                  docIniFile["main"]["audio-volume"] = String(i2s.getVolume());
                  // Saving new volume to app.json
                  SD_MMC.remove("/app.json");
                  File file = SD_MMC.open("/app.json", FILE_WRITE);
                  serializeJson(docIniFile, file);
                  file.close();
                }else if (header.indexOf("GET /soundPoolSave") >= 0) { 
                  //Serial.println("Save SoundPool from WebUI");
                  int paramStart = header.indexOf("/soundPoolSave?") + String("/soundPoolSave?").length();
                  int paramEnd = header.indexOf("&", paramStart); 
                  //Serial.println("ParamStart: " + String(paramStart) + " ParamEnd: " + String(paramEnd));
                        
                  String soundPoolName = header.substring(paramStart, paramEnd);        
                  //Serial.println("SoundPool Name: " + soundPoolName);
                  docIniFile["ActionKeys"]["Key4"]["soundPool"] = soundPoolName;
                  // Saving new SoundPool to app.json
                  SD_MMC.remove("/app.json");
                  File file = SD_MMC.open("/app.json", FILE_WRITE);
                  serializeJson(docIniFile, file);
                  file.close();
                }
            } else {
                index += "<!DOCTYPE html><html>";
                index += "<head><meta name=\"viewport\" content=\"width=device-width, initial-scale=1\"><title>" + S_HOST_NAME+ "-AMPlayer</title>";
                index += "<link rel=\"icon\" href=\"data:,\">";
                index += "<script>";
                index += "  function start(service){ ";
                index += "    document.getElementById(\"loader\").style.display = \"block\";";
                index += "    fetch(service, { method: 'GET' })";
                index += "      .then(res => res.text())";
                index += "      .then(() => { ";
                index += "        document.getElementById(\"loader\").style.display = \"none\";";
                index += "      })";
                index += "      .catch(() => {";
                index += "        document.getElementById(\"loader\").style.display = \"none\";";
                index += "        alert(\"Fehler\");";
                index += "      });";

                index += "    };";
                index += "</script>";
                // CSS to style the on/off buttons 
                // Feel free to change the background-color and font-size attributes to fit your preferences
                index += "<style>html { font-family: Helvetica; display: inline-block; margin: 5px auto; text-align: center;}";
                index += "table { display: table; border-collapse: separate; border-spacing: 2px; border-color: gray; margin-left: auto; margin-right: auto; text-align: left;}";
                index += "table tbody td {padding: 5px 6px; border-bottom: 1px solid #e9ecef;  vertical-align: middle; word-wrap:break-word;}";
                index += "button { display: block;  width: 100%; font-size: 32px; margin: 2px; min-width: 60px;}";
                index += "#loader{display:none;position:fixed;top:0;left:0;width:100\%;height:100%;background:#0008;color:white;font-size:20px;text-align:center;padding-top:50%;z-index:9999;}";
                index += "</style></head>";
                index += "<div id=\"loader\">Loading...</div>";
                index += "<table style=\"margin-top: 5px;\">";
                index += "<caption><b>ESP32 Audio-Message-Player</b></caption>";
                index += "<tr>";
                      index += "<td><b>Time</b></td>";
                      index += "<td>" + rtc.getTime() + "</td>";
                  index += "</tr>";
                  index += "<tr>";
                    index += "<td style=\"width: 30%;\">Host-Name</td>";
                    index += "<td>" + S_HOST_NAME + "</td>";
                  index += "</tr>";
                  index += "<tr>";
                    index += "<td>MQTT House</td>";
                    index += "<td>" + S_MQTT_HOUSE + "</td>";
                  index += "</tr>";
                  index += "<tr>";
                    index += "<td>WiFi SSID</td>";
                    index += "<td>" + S_WIFI_SSID + "</td>";
                  index += "</tr>";
                  index += "<tr>";
                    index += "<td>IP</td>";
                    index += "<td>" + WiFi.localIP().toString() + "</td>";
                  index += "</tr>";
                  index += "<tr>";
                    index += "<td>RSSI</td>";
                    index += "<td>" + String(WiFi.RSSI()) + " dBm  </td>";
                  index += "</tr>";
                  index += "<tr>";
                    index += "<td>Volume</td>";
                    index += "<td>" + String(i2s.getVolume()) + "  /  Init: " + String(S_AUDIO_VOLUME) + " /  Prev: " + String(PreviousVolume) + "</td>";
                  index += "</tr>";
                  index += "<tr>";
                    index += "<td>Last Action</td>";
                    index += "<td>" + String(LastAction.c_str()) + "</td>";
                  index += "</tr>";
                  index += "<tr>";
                    index += "<td>Free Heap</td>";
                    uint32_t number = ESP.getFreeHeap();
                    char buffer[12];
                    sprintf(buffer, "%u", number);
                    index += "<td>" +  String(buffer) + "</td>";
                  index += "</tr>";
                  index += "<tr>";
                    index += "<td>Version</td>";
                    index += "<td>" + String(FIRMWARE_VERSION) + "</td>";
                  index += "</tr>";
                index += "</table>";

                //Table with buttons to trigger actions Volume up/down, restore and save
                index += "<table style=\"margin-top: 5px;\">";
                index += "<caption><b>&#128266;&nbsp;Volumen</b></caption>";
                  index += "<tr>";
                    index += "<td><button onclick=\"start('/volUp');\" >&#128264;&nbsp;+</button></td>";
                    index += "<td><button onclick=\"start('/volDown');\" >&#128265;&nbsp;-</button></td>";
                    index += "<td><button onclick=\"start('/volRestore');\" >&#8634;</button></td>";
                    index += "<td><button onclick=\"start('/volSave');\" >&#128190;</button></td>";
                    index += "</tr><tr>";
                      index += "<td style=\"text-align: center;\" colspan=\"4\">";
                      index += "<b>&#12340;&nbsp;Test-sounds</b>";
                      index += "</td>";
                    index += "<tr>";
                    index += "<td><button onclick=\"start('/test1');\" >&#128276;</button></td>";
                    index += "<td><button onclick=\"start('/test2');\" >&#128021;</button></td>";
                    index += "<td><button onclick=\"start('/test3');\" >&#129311;</button></td>";
                    index += "<td><button style=\"font-size: 16px;\" onclick=\"start('/test4');\" >&#128251;<br>/&#9209;</button></td>";
                  index += "</tr>";
                  index += "<tr>";
                    index += "<td><p>Key4<br>SoundPool</p></td>";
                    index += "<td colspan=\"2\"><select style=\"font-size: 22px;\" id=\"SoundPool\" >";

                    String soundPoolName = docIniFile["ActionKeys"]["Key4"]["soundPool"].as<String>();
                    JsonObject soundPools = docIniFile["ActionKeys"]["Key4"]["soundPools"].as<JsonObject>();

                    for (JsonPair kv : soundPools) {
                        String key = kv.key().c_str();
                        if( key == soundPoolName) {
                          index += "  <option value=\"" + key + "\" selected>" + key + "</option>";
                        } else {
                          index += "  <option value=\"" + key + "\">" + key + "</option>";
                        }
                      }

                      index += "</select></td>";
                      index += "<td><button style=\"font-size: 14px; \" onclick=\"start('/soundPoolSave?' + document.getElementById('SoundPool').value + '&');\" >&#128190;</button></td>";
                  index += "</tr>";
                index += "</table>";  
                index += "</body></html>";

