nmaciol/ESP32-Audio-Message-Player-main/src/main.cpp
            }
            wifiClient.println(index);

            // The HTTP response ends with another blank line
            wifiClient.println();

          } else { // if you got a newline, then clear currentLine
            currentLine = "";
          }
        } else if (c != '\r') {  // if you got anything else but a carriage return character,
          currentLine += c;      // add it to the end of the currentLine
        }
      }
    }
    // Clear the header variable
    header = "";
    // Close the connection
    wifiClient.stop();
    //Serial.println("Client disconnected.");
    //Serial.println("");
    return;
  }

// Helper function to play error messages via TTS Comodore C64 voice
void playError(const char *sText)
{
  auto cfg = i2s.defaultConfig();
  cfg.bits_per_sample = sam.bitsPerSample();
  cfg.channels = sam.channels();
  cfg.sample_rate = sam.sampleRate();
  cfg.sd_active = false;
  i2s.begin(cfg);
  i2s.setVolume(0.5);
  sam.say(sText);
  //
  delay(1000);
  
}

// TTS setup Google Query
const char *tts(const char *text, const char *lang = "de-DE", const char *speed = "0.7")
{
  query = S_TTS_QRY_GOOGLE.c_str();
  query.replace("%1", lang);
  query.replace("%2", speed);
  Str encoded(text);
  encoded.urlEncode();
  query.replace("%3", encoded.c_str());
  return query.c_str();
}

// Worker function for Text-To-MP3 conversion with Google TTS
void TTM_Worker_Google(String sTts)
{

  char buf[240];
  // Serial.println("TTM " + sTts);
  getTtmFileName(sTts, buf);
  // show results
  // Serial.print ("Converted string: ");
  // Serial.println (buf);
  SD_MMC.begin();
  if (!SD_MMC.open("/tts-mp3/" + String(buf) + ".mp3", FILE_READ))
  {

    // Serial.print("File  --- ");
    // Serial.print(buf);
    // Serial.println(" --- does not exist");
    //  url
    const char *url_str = tts(sTts.c_str(), S_TTS_LANG.c_str(), S_TTS_SPEED.c_str());
    // Serial.println("URL Query -- " + String(url_str));
    //  generate mp3 with the help of google translate
    url.begin(url_str, "audio/mp3");
    decoder.begin();
    // copy file
    SD_MMC.begin();
    file = SD_MMC.open("/tts-mp3/" + String(buf) + ".mp3", FILE_WRITE);
    file.seek(0); // overwrite from beginning
    copier.begin(file, url);
    copier.copyAll();
    file.close();
  }
  // Serial.println("TTM Push Queue MP3  " + String(PreviousVolume));
  if (PreviousVolume > 0.01)
  {
    queueOrder.push("mp3" + TempVolume + "!/tts-mp3//" + String(buf) + ".mp3");
  }
  else
  {
    queueOrder.push("mp3/tts-mp3//" + String(buf) + ".mp3");
    // Serial.println ("TTM -> TTS " +  String(buf));
  }
}

// Helper function to stop playing sound and live streams, and to clear the URL and decoder buffers
void stopPlaySound()
{
  // Serial.println("Stop Play Sound");
  currentLiveStream = "";
  decoder.end();
  url.flush();
  url.end();
  url.clear();
  copier.end();
}
//  Button 3
void stopPlaySoundOn(bool, int, void *)
{
  stopPlaySound();
}

// Button 4
// This function will play a random sound from the playlist defined in app.json when Button 4 is pressed. 
// It also implements a cooldown mechanism to prevent multiple triggers within a short time frame.
// When PIR on Key4 is triggered, play a random sound from the playlist defined in app.json and prevent multiple triggers within a short time frame defined by "interval" in app.json

void playKey4SoundOn(bool, int, void *)
{

  if ( queueOrder.isEmpty())  // Is free to take new items
  {
    // Serial.println("Sound started--Key");
    if (startActionKey4Time == 0 || rtc.getEpoch() - startActionKey4Time > docIniFile["ActionKeys"]["Key4"]["interval"].as<int>())
    {
      if(B_STOP2PRESS_ENABLE) {
        stopPlaySound();
      }

      startActionKey4Time = rtc.getEpoch();

      String soundPoolName = docIniFile["ActionKeys"]["Key4"]["soundPool"].as<String>();
      JsonArray playlist = docIniFile["ActionKeys"]["Key4"]["soundPools"][soundPoolName].as<JsonArray>();
      int playlistSize = playlist.size();
      
      // Zufallsgenerator mit analogRead auf einem freien Pin initialisieren
      int randomIndex = randomRange(0, playlistSize - 1);

      Serial.println("Naechster Sound: "  + String(randomIndex) + " / " + String(playlistSize));
      const char* nextTrack = playlist[randomIndex].as<const char*>();

      queueOrder.push(nextTrack);
      mqttClient.publish((S_HOST_NAME + "/key4").c_str(), rtc.getTime().c_str(), 24);
      Serial.println ("Play -- " + String(nextTrack));

    } else if (B_STOP2PRESS_ENABLE) {
        //Serial.println("Button 4 pressed again during cooldown, stopping sound...");
        // If stop2Press is enabled, stop the current sound and reset the cooldown timer
        stopPlaySound();
        startActionKey4Time = 0;
    }
  }  else {
      Serial.println("Button 4 pressed but queue is not empty, skipping...");
      if(B_STOP2PRESS_ENABLE) {
        // If stop2Press is enabled, clear the queue to stop the current sound by second press, and reset the cooldown timer
        while (!queueOrder.isEmpty())
        {
          String a = queueOrder.pop();
        }
      }
  }
}
void playKey4SoundOff(bool, int, void *)
{
    // Serial.println("Sound stopped--Key");
}

// Button 5
void audioVolumeDownOn(bool, int, void *)
{
  i2s.incrementVolume(-0.05);
};
// Button 6
void audioVolumeUpOn(bool, int, void *)
{
  i2s.incrementVolume(0.05);
};

// MQTT callback function
void mqttCallback(char *topic, byte *message, unsigned int length)
{
  String messageTemp;
  for (int i = 0; i < length; i++)
  {
    Serial.print((char)message[i]);
    messageTemp += (char)message[i];
  }
  Serial.println();
  Serial.println(topic);
  // Execute MQTT-command
  if (String(topic) == S_HOST_NAME + "/mp3" or String(topic) == S_MQTT_HOUSE + "/mp3")
  {
    // Serial.print("MP3 starting  -- ");
    queueOrder.push("mp3" + messageTemp);
  }
  else if (String(topic) == S_HOST_NAME + "/incVol" or String(topic) == S_MQTT_HOUSE + "/incVol")
  {
    // Serial.println("Setting Volume");
    if (PreviousVolume > 0) {
      i2s.incrementVolume((float)messageTemp.toFloat());
    }
    else {
      i2s.incrementVolume((float)messageTemp.toFloat());
      PreviousVolume=i2s.getVolume();
    }
  }
  else if (String(topic) == S_HOST_NAME + "/setVol" or String(topic) == S_MQTT_HOUSE + "/setVol")
  {
    // Serial.println("Setting Volume");
    i2s.setVolume((float)messageTemp.toFloat());
    docIniFile["main"]["audio-volume"] = messageTemp;
    // Saving new volume to app.json
    SD_MMC.remove("/app.json");
    File file = SD_MMC.open("/app.json", FILE_WRITE);
    serializeJson(docIniFile, file);
    file.close();

