nmaciol/ESP32-Audio-Message-Player-main/src/main.cpp
    PreviousVolume = 0;
  }
  else if (String(topic) == S_HOST_NAME + "/resVol" or String(topic) == S_MQTT_HOUSE + "/resVol")
  {
    // Serial.println("Setting Volume");
    // Restore volume from app.json
    i2s.setVolume((float)S_AUDIO_VOLUME.toFloat());
    PreviousVolume = 0;
  }
  else if (String(topic) == S_HOST_NAME + "/stop" or String(topic) == S_MQTT_HOUSE + "/stop")
  {
    Serial.println("MQTT Stopping playing");
    currentLiveStream = "";
    i2s.setMute(true);
    decoder.end();
    url.flush();
    url.end();
    url.clear();
    // i2s.end();
    copier.end();
    delay(100);
    i2s.setMute(false);
    //queueOrder.push("mp3" + S_START_SOUND);
  }
  else if (String(topic) == S_HOST_NAME + "/tts" or String(topic) == S_MQTT_HOUSE + "/tts")
  {
    queueOrder.push("tts" + messageTemp);
  }
  else if (String(topic) == S_HOST_NAME + "/ls/mp3" or String(topic) == S_MQTT_HOUSE + "/ls/mp3")
  {
    Serial.println("ls/mp3");
    currentLiveStream = messageTemp;
    acceptMime = "audio/mp3";
  }
  else if (String(topic) == S_HOST_NAME + "/ls/aac" or String(topic) == S_MQTT_HOUSE + "/ls/aac")
  {
    Serial.println("ls/aac");
    currentLiveStream = messageTemp;
    acceptMime = "audio/aac";
  }
  else if (String(topic) == S_HOST_NAME + "/ttm" or String(topic) == S_MQTT_HOUSE + "/ttm")
  {
    // Serial.print("TTM starting  -- ");
    if (messageTemp.length() > S_TTS_MAX_LEN_TTM.toInt())
    {
      queueOrder.push("tts" + messageTemp);
    }
    else
    {
      queueOrder.push("ttm" + messageTemp);
    }
  }
  else if (String(topic) == S_HOST_NAME + "/delttm")
  {
    char buf[240];
    getTtmFileName(messageTemp, buf);
    // show results
    String filename = "/tts-mp3/" + String(buf) + ".mp3";
    SD_MMC.begin();
    if (SD_MMC.remove(filename))
    {
      // Serial.print("File ");
      // Serial.print(filename);
      // Serial.println(" deleted successfully.");
    }
    else
    {
      // Serial.print("Failed to delete file ");
      // Serial.println(filename);
    }
  }
  else if (String(topic) == S_HOST_NAME + "/speed" or String(topic) == S_MQTT_HOUSE + "/speed")
  {
    S_TTS_SPEED = messageTemp;

  }
  else if (String(topic) == S_HOST_NAME + "/ping")
  {
    uint32_t number = ESP.getFreeHeap();
    char buffer[12];
    sprintf(buffer, "%u", number);
    // Serial.println("Connection test Ping");
    mqttClient.publish((S_HOST_NAME + "/FreeHeap").c_str(), (String(buffer)).c_str(), 24);
    mqttClient.publish((S_HOST_NAME + "/version").c_str(), FIRMWARE_VERSION, 24);
  

    mqttClient.publish((S_HOST_NAME + "/currVol").c_str(), (String(i2s.getVolume())).c_str(), 24);
    mqttClient.publish((S_HOST_NAME + "/IP").c_str(),  (WiFi.localIP().toString()).c_str());
    mqttClient.publish((S_HOST_NAME + "/SSID").c_str(),  (WiFi.SSID()).c_str());
    mqttClient.publish((S_HOST_NAME + "/LastAction").c_str(),  LastAction.c_str());
    
    // Sleep Mode
    wifi_ps_type_t ps;
    esp_wifi_get_ps(&ps);
    if (ps == WIFI_PS_MIN_MODEM)
    {
      mqttClient.publish((S_HOST_NAME + "/sleepMode").c_str(), "MIN_MODEM");
    }
    else if (ps == WIFI_PS_MAX_MODEM)
    {
      mqttClient.publish((S_HOST_NAME + "/sleepMode").c_str(), "MAX_MODEM");
    }
    else
    {
      mqttClient.publish((S_HOST_NAME + "/sleepMode").c_str(), "NONE");
    }

    // WiFi RSSI
    mqttClient.publish((S_HOST_NAME + "/rssi").c_str(), (String(WiFi.RSSI())).c_str());
    mqttClient.publish((S_HOST_NAME + "/time").c_str(), (rtc.getTime()).c_str());
  }
  else if (String(topic) == S_HOST_NAME + "/reboot")
  {
    // Serial.println("Reboot");
    i2s.end();
    decoder.end();
    ESP.restart();
  }
  else if (String(topic) == S_HOST_NAME + "/lpm")  //  Power Mode
  {
    if(messageTemp=="on"){
      Serial.print("WiFi set sleep mode ON");
      delay(100);
      //WiFi.setSleep(true); 
      esp_wifi_set_ps(WIFI_PS_MIN_MODEM);
      delay(100);
      //queueOrder.push("ttm20!Low Power Mode on");
    } else {
      WiFi.setSleep(false);
    }
  }
  else if (String(topic) == S_HOST_NAME + "/sleep")  // Deep Sleep
  {
    Serial.println("Deep Sleep");
    delay(100);
    esp_sleep_enable_timer_wakeup((uint64_t)messageTemp.toInt() * 1000000); // Convert seconds to microseconds
    esp_deep_sleep_start();
  } 
  else if (String(topic) == S_HOST_NAME + "/getLastAct")  // Last Action
  {
    mqttClient.publish(("esp32/LastAction/" + String(S_HOST_NAME)).c_str(), LastAction.c_str());
  } 
  //Serial.println(String(topic) + " - " + messageTemp);
} 

// MQTT reconnect
void mqttReconnect()
{
  // Loop until we're reconnected
  while (!mqttClient.connected())
  {
    MqttConnectErrorCounter++;
    if(MqttConnectErrorCounter >= 20){
      Serial.println("MQTT connection failed 20 times - Reboot");
      ESP.restart();
    }
    // Serial.print("Attempting MQTT connection...");
    if (mqttClient.connect((S_HOST_NAME + "--mp3Player").c_str(), S_MQTT_USER.c_str(), S_MQTT_PASSWORD.c_str()))
    {
      // Serial.println("connected");
      //  Host
      mqttClient.subscribe((S_HOST_NAME + "/mp3").c_str());
      mqttClient.subscribe((S_HOST_NAME + "/reboot").c_str());
      mqttClient.subscribe((S_HOST_NAME + "/setVol").c_str());
      mqttClient.subscribe((S_HOST_NAME + "/incVol").c_str());
      mqttClient.subscribe((S_HOST_NAME + "/resVol").c_str());
      mqttClient.subscribe((S_HOST_NAME + "/stop").c_str());
      mqttClient.subscribe((S_HOST_NAME + "/tts").c_str());
      mqttClient.subscribe((S_HOST_NAME + "/ttm").c_str());
      mqttClient.subscribe((S_HOST_NAME + "/delttm").c_str());
      mqttClient.subscribe((S_HOST_NAME + "/ping").c_str());
      mqttClient.subscribe((S_HOST_NAME + "/speed").c_str());
      mqttClient.subscribe((S_HOST_NAME + "/ls/aac").c_str());
      mqttClient.subscribe((S_HOST_NAME + "/ls/mp3").c_str());
      mqttClient.subscribe((S_HOST_NAME + "/lpm").c_str());  // Low Power Mode
      mqttClient.subscribe((S_HOST_NAME + "/sleep").c_str());  // Deep sleep
      mqttClient.subscribe((S_HOST_NAME + "/getLastAct").c_str());  // 

