nmaciol/ESP32-Audio-Message-Player-main/src/main.cpp
      // House
      mqttClient.subscribe((S_MQTT_HOUSE + "/tts").c_str());
      mqttClient.subscribe((S_MQTT_HOUSE + "/ttm").c_str());
      mqttClient.subscribe((S_MQTT_HOUSE + "/setVol").c_str());
      mqttClient.subscribe((S_MQTT_HOUSE + "/incVol").c_str());
      mqttClient.subscribe((S_MQTT_HOUSE + "/resVol").c_str());
      mqttClient.subscribe((S_MQTT_HOUSE + "/stop").c_str());
      mqttClient.subscribe((S_MQTT_HOUSE + "/mp3").c_str());
      mqttClient.subscribe((S_MQTT_HOUSE + "/speed").c_str());
      mqttClient.subscribe((S_MQTT_HOUSE + "/ls/mp3").c_str());      
      mqttClient.subscribe((S_MQTT_HOUSE + "/ls/aac").c_str());
      // Startup
      delay(100);
      if (bStartup)
      {
        mqttClient.publish((S_MQTT_HOUSE + "/IP").c_str(), (S_HOST_NAME + " - " + WiFi.localIP().toString()).c_str());
        //queueOrder.push("ttm" + S_HOST_NAME + " is online with IP " + WiFi.localIP().toString());
        queueOrder.push("ttm30!" + S_HOST_NAME );

        bStartup = false;
      }
      MqttConnectErrorCounter = 0;
    }
    else
    {
      Serial.println("MQTT connect failed -  try again in 5 seconds");
      //  Wait 5 seconds before retrying
      delay(5000);
    }
  }
}

// Setuo  i2s, Wifi, MQTT, FTP
void setup()
{
  Serial.begin(115200); // <--------------- do not comment out
  pinMode(errorLED, OUTPUT);

  //  For development
  //--------------------
  AudioToolsLogger.begin(Serial, AudioToolsLogLevel::Error);
  // Statt Info geht; Debug, Info, Warning, Error
  // setup audiokit before SD!
  // setup output
  auto cfg = i2s.defaultConfig(TX_MODE);
  if (!i2s.begin(cfg))
  {
    // Serial.println("i2s failed");
    stop();
  }

  // Initialize random seed with esp_random() for better randomness in sound selection
  randomInit();
  
  // Set globVar with app.json values
  if (!setGlobalVar())
  {
    // SD Card error
    digitalWrite(errorLED, LOW);
  }
  else
  {
    digitalWrite(errorLED, HIGH);
  }
  i2s.setVolume(S_AUDIO_VOLUME.toFloat());

  // Blocking Key4 call to prevent multiple triggers within a short time frame when the device is started and the button is pressed.
  startActionKey4Time = rtc.getEpoch();

  // setup additional buttons
  action.add(i2s.getKey(3), stopPlaySoundOn);
  action.add(i2s.getKey(4), playKey4SoundOn, playKey4SoundOff  );
  action.add(i2s.getKey(5), audioVolumeDownOn);
  action.add(i2s.getKey(6), audioVolumeUpOn);

  // Connecting to a WiFi network
  // Serial.println();
  // Serial.print("Connecting to SSID: ");
  // Serial.println(WIFI_SSID);

  WiFi.mode(WIFI_STA);
  WiFi.setSortMethod(WIFI_CONNECT_AP_BY_SIGNAL);
  WiFi.setScanMethod(WIFI_ALL_CHANNEL_SCAN);
  WiFi.begin(S_WIFI_SSID.c_str(), S_WIFI_PASSWORD.c_str());

  int wifiConnectCounter = 0;
  while (WiFi.status() != WL_CONNECTED)
  {
    delay(500);
    wifiConnectCounter++;
    if (wifiConnectCounter > 20)
    {
      playError("ERROR 3  ");
      playError("NETWORK CONNECTION ERROR");
      Serial.print("Network connection failed");
      delay(5000000);
      ESP.restart();
    }
    Serial.print(".");
  }

  // Serial.println("WiFi connected");
  // Serial.println("IP address: ");
  // Serial.println(WiFi.localIP());

   delay(100);

  // Setup MDNS responder
  if (!MDNS.begin(S_HOST_NAME.c_str())) {
    Serial.println("Error setting up MDNS responder!");
    while(1) {
      delay(1000);
    }
  }
  delay(100);

  // Setup MQTT
  mqttClient.setServer(S_MQTT_SERVER.c_str(), S_MQTT_PORT.toInt());
  mqttClient.setCallback(mqttCallback);

  delay(10);

  // Initialize time via NTP
  /*---------set with NTP---------------*/
  configTime(gmtOffset_sec, daylightOffset_sec, ntpServer);
  struct tm timeinfo;
  if (getLocalTime(&timeinfo)){
    rtc.setTimeStruct(timeinfo); 
  }

  delay(10);

  // Start FTP server with username and password
  ftpServer.begin(S_FTP_SVR_USER.c_str(), S_FTP_SVR_PASSWORD.c_str());
  //
  // Serial.println("FTP server started!");
  //
  delay(10);
  queueOrder.push("mp3" + S_START_SOUND);
  bStartup = true;

  // Start Web Server
  server.begin();

  Serial.println("+-------------------------------------------+");
  Serial.println(" Host-Name  : " + S_HOST_NAME);
  Serial.println(" MQTT House : " + S_MQTT_HOUSE);
  Serial.println(" WiFi SSID  : " + S_WIFI_SSID);
  Serial.println(" FTP  user  : " + S_FTP_SVR_USER);
  Serial.println(" MQTT SRV   : " + S_MQTT_SERVER);
  Serial.println(" Volume     : " + String(i2s.getVolume()) + " Sys: " + String(S_AUDIO_VOLUME) + " Prev: " + String(PreviousVolume) );
  Serial.println(" ");
  Serial.println(" IP         : " + WiFi.localIP().toString());
  Serial.println(" RSSI       : " + String(WiFi.RSSI()) + " dBm");
  Serial.println(" Time       : " + rtc.getTime());
  Serial.println(" Version    : " + String(FIRMWARE_VERSION));
  
  Serial.println(" ");
}

void loop()
{ 
  // Web UI Handler - check if clients are available and handle requests
  if(B_WEBUI_ENABLE)  {
    wifiClient = server.available();
    if(wifiClient) {
      handleWebUI();   // handle the web request                        
      return;          // return to avoid executing the rest of the loop while handling the web request
    }
  } 
  
  
  if(true){
      if(B_MQTT_CLIENT_ENABLE){
          // MQTT Reconnect when the connection is lost
          if (!mqttClient.connected())
          {
            mqttReconnect();
          }
          // MQTT
          mqttClient.loop();
      }

      // Execute all actions if the corresponding button/ pin is low
      if (B_ACTION_KEYS_ENABLE) {
        action.processActions();
      }

      // Handle FTP server operations
      if(B_FTP_SERVER_ENABLE){
           ftpServer.handleFTP(); // Continuously process FTP requests
      }

      // Stop Live Strem
      if (!queueOrder.isEmpty() and currentLiveStream.length() > 0 and !bLiveStreamPause)
      {
        // Serial.println("Stop LS");
        decoder.end();
        delay(100);
        url.flush();
        url.end();
        url.clear();
        copier.end();
        bLiveStreamPause = true;
      }

      // Check out queues and work items
      if (!copier.copy()  or copier.copy() == 0)  // Is free to take new items
        {
          if ( true){
          // Start Live Stream
            if (currentLiveStream.length() > 0 and queueOrder.isEmpty())
            {
              // Serial.println("Start LS");
              //  Prefix Volume control
              if (currentLiveStream.substring(2, 3).compareTo("!") == 0)
              {
                if (currentLiveStream.substring(0, 2).toInt() > 3)
                {
                  if (PreviousVolume == 0)
                  {
                    PreviousVolume = i2s.getVolume();
                  }
                  TempVolume = currentLiveStream.substring(0, 2);
                  i2s.setVolume(("0." + TempVolume).toFloat());
                  // Serial.println("New volume -- " + String(i2s.getVolume()));
                }
              }
              // LV-Stream
              Serial.println("LS -- " + currentLiveStream );
              decoder.begin();
              if (!url.begin(currentLiveStream.c_str(), (acceptMime.c_str()))){
            
                Serial.println("LS  -- error " );
              
                currentLiveStream = "";
                mqttClient.publish("esp32/error", (S_HOST_NAME + " - Live stream address no response").c_str());
              } else {
                Serial.println("LS  -- start " );
                copier.begin(decoder, url);
                copier.copy();
                bLiveStreamPause = false;
              }
            }
          }

        // MP3 TTS TTM
        if (!copier.copy())
        {

          if (PreviousVolume > 0)
          {
            i2s.setVolume(PreviousVolume);
            PreviousVolume = 0;
            TempVolume = "";
          }
          if (PreviousLang.length() > 0)
          {
            S_TTS_LANG = PreviousLang;
            PreviousLang = "";
          }

          if (!queueOrder.isEmpty())
          {
            String order = queueOrder.pop();
            // Serial.println ("Loop - " + order);
            String orderTyp = order.substring(0, 3);
            String orderText = order.substring(3);

            LastAction = rtc.getDateTime() + " - " + orderTyp + " - " + orderText;  
            // Prefix Volume control
            if (orderText.substring(2, 3).compareTo("!") == 0)
            {
              if (orderText.substring(0, 2).toInt() > 3)
              {
                if (PreviousVolume == 0)
                {
                  PreviousVolume = i2s.getVolume();
                }
                TempVolume = orderText.substring(0, 2);
                i2s.setVolume(("0." + TempVolume).toFloat());
                // Serial.println("New volume -- " + String(i2s.getVolume()));
              }
              else if (orderText.substring(0, 2) == "en" or orderText.substring(0, 2) == "pl")
              {
                PreviousLang = S_TTS_LANG;
                S_TTS_LANG = orderText.substring(0, 2);
              }
              // Serial.println("Prefix -- " + orderText.substring(0, 2));
              orderText = orderText.substring(3);
            }

            if (orderTyp == "mp3")
            {
              // Serial.println("Loop Sound started -- " + orderText);
              SD_MMC.begin();
              audioFile = SD_MMC.open(orderText);
              if (audioFile)
              {
                decoder.begin();
                copier.begin(decoder, audioFile);
                copier.copy();
              }
              else
              {
                mqttClient.publish("esp32/error", (S_HOST_NAME + " / " + orderText + " - does not exist").c_str());
                Serial.println("File open failed -- " + orderText );
                LastAction = rtc.getDateTime() + " - " + "not exist" + " - " + orderText;
              }
            }
            else if (orderTyp == "ttm")
            {

              TTM_Worker_Google(orderText);
            }
            else if (orderTyp == "tts")
            {
              // Serial.println("TTS " + orderText);
              const char *url_str = tts(orderText.c_str(), S_TTS_LANG.c_str(), S_TTS_SPEED.c_str());
              // generate mp3 with the help of google tts
              decoder.begin();
              if (!url.begin(url_str, "audio/mp3"))
              {
                mqttClient.publish( "esp32/error", (S_HOST_NAME + " / " + url_str + " - no response").c_str());
              }
              else
              {
                // Serial.println("TTS Url: " + String(url_str));
                copier.begin(decoder, url);
                copier.copyAll();
              }
            } else {
                Serial.println("Unknown order type -- " + orderTyp);
                mqttClient.publish( "esp32/error", (S_HOST_NAME + " / " + orderTyp + " - unknown order type").c_str()); 
                LastAction = rtc.getDateTime() + " - " + "unknown" + " - " + orderText; 

            }

              if(B_LOW_POWER_MODE_ENABLE) {
  
                esp_wifi_set_ps(WIFI_PS_MIN_MODEM);
                Serial.println("Set sleep mode after action -- " + String(S_HOST_NAME));
              }
          }
        }
      }
  }
}